//===========================================================
//
// ライト処理 [light.h]
// Author : 大原　怜将
//
//===========================================================
#ifndef _LIGHT_H_             // このマクロ定義がされてなかったら
#define _LIGHT_H_             // 2重インクルード防止のマクロ定義をする

//===========================================================
// ライトクラス定義
//===========================================================
class CLight
{
public:
	CLight();                 // コンストラクタ
	~CLight();                // デストラクタ
	
	void Init(void);          // 初期化処理    
	void Uninit(void);        // 終了処理
	void Update(void);        // 更新処理

private:
						  
	D3DLIGHT9 m_light[3];     // カメラの情報
	D3DXVECTOR3 m_vecDir[3];  // 設定用方向ベクトル

};

#endif