//===========================================================
//
// マップに配置れている柵処理[mapobject_fance.cpp]
// Author 大原怜将
//
//===========================================================
#include "mapobject_fance.h"

//===========================================================
// コンストラクタ
//===========================================================
CMapObject_Fance::CMapObject_Fance()
{
}

//===========================================================
// コンストラクタ
//===========================================================
CMapObject_Fance::CMapObject_Fance(const char* aModelFliename, int nPriority) : CObjectX(aModelFliename, nPriority)
{
}

//===========================================================
// デストラクタ
//===========================================================
CMapObject_Fance::~CMapObject_Fance()
{
}

//===========================================================
// 初期化処理
//===========================================================
HRESULT CMapObject_Fance::Init(void)
{
	CObjectX::Init();

	return S_OK;
}

//===========================================================
// 終了処理
//===========================================================
void CMapObject_Fance::Uninit(void)
{
	CObjectX::Uninit();
}

//===========================================================
// 更新処理
//===========================================================
void CMapObject_Fance::Update(void)
{
	CObjectX::Update();
}

//===========================================================
// 描画処理
//===========================================================
void CMapObject_Fance::Draw(void)
{
	CObjectX::Draw();
}

//===========================================================
// 生成処理
//===========================================================
CMapObject_Fance* CMapObject_Fance::Create(const char* aModelFliename, int nPriority)
{
	CMapObject_Fance* pFance = new CMapObject_Fance(aModelFliename, nPriority);

	if (pFance != nullptr)
	{
		pFance->Init();
	}

	return pFance;
}
