//===========================================================
//
// 水たまりの波紋処理[ripples.h]
// Author 大原怜将
//
//===========================================================
#ifndef _RIPPLES_H_
#define _RIPPLES_H_

//===========================================================
// インクルードファイル
//===========================================================
#include "object3D.h"

//===========================================================
// 前方宣言
//===========================================================

//===========================================================
// 水たまりの波紋クラス定義
//===========================================================
class CRipples : public CObject3D
{
public:
	CRipples();
	CRipples(D3DXVECTOR3 pos);
	~CRipples();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CRipples* Create(D3DXVECTOR3 pos);

private:



};

#endif