//===========================================================
//
// タイム処理[time.h]
// Author 大原怜将
//
//===========================================================
#ifndef _TIME_H_             //このマクロ定義がされてなかったら
#define _TIME_H_             //2重インクルード防止のマクロ定義をする

//===========================================================
// インクルードファイル
//===========================================================
#include "number.h"

//===========================================================
// タイムクラス定義
//===========================================================
class CTime : public CNumber
{
public:
	CTime();  //コンストラクタ
	CTime(D3DXVECTOR3 pos);  //コンストラクタ(オーバーロード)
	~CTime();  //デストラクタ

	HRESULT Init(void);   // 初期化処理    
	void Uninit(void);    // 終了処理
	void Update(void);    // 更新処理
	void Draw(void);      // 描画処理

	static CTime *Create(void);  // 生成処理
	static void TimeCounter(void);

private:

};

#endif